# ObjAreaN

## Description
HObjAreaN, this VS Call is the same as HOBJArea() call but it gives more accurate result when the object is a polyline.

```pascal
FUNCTION ObjAreaN(ObjectHandle : HANDLE): REAL;
```

```python
def vs.ObjAreaN(ObjectHandle ):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ObjectHandle|HANDLE|   |

## Examples
```pascal
area := HOBJAreaN(object);
```

## Version
Availability: from Vectorworks 2012

## Category
* Object Info